"use strict";

//1
// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

let i = 0;
while (i <= 10) {
  console.log(i);
  i++;
}

//2
// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue.

let number = 20;
for (let i = 0; i <= number; i++) {
  if (i % 2 !== 0) {
    continue;
  }
  console.log(i);
}

//3
// Вивести на екран таблицю множення числа 7 за допомогою циклу for.
for(let i = 1; i <= 10; i++) {
  console.log(`7 * ${i} = ${7 * i}`);
}


//4
// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.
let g = 1
while(g <= 5) {
  console.log(g);
  g++
}

//5
// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.
for(let i = 1; i <= 10; i++) {
  if(i === 7) {
    break;
  }
  console.log(i);
}


//6
// Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = 10;
for(let i = 1; i < 20; i++) {
  console.log(i);
  if(i >= n) {
    break;
  }
}


//7
// За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let k = 1;
while(k <= 20) {
  if(k % 3 === 0 ) {
    k++
    continue;
  }
  console.log(k);
  k++
}
 