"use strict";


// Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".
//1
let input = prompt('введіть текст', '')
let input2 = prompt('введіть текст', '')
if(input !== '' && input2 !== '') {
    alert('Обидва поля заповнені')
} else {
    alert('Не всі поля заповнені')
}


//2
// Створити розмітку  з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".
let sum = +prompt('введіть суму', '')
if(sum > 10) {
    alert('Сума більша за 10')
} else if(sum <= 10) {
    alert('Сума менша або дорівнює 10')
} else {
    alert('не може бути')
}


//3
// Створити розмітку  з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".
let text = prompt('введіть текст', '')
if(text === "JavaScript") {
    alert('текст мстить слово JavaScript')
} else {
    alert('текст не містить слово JavaScript') 
}


//4
// Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".
let result = +prompt('введіть число', '')
if(result > 10 && result < 20) { //?
    alert('Число входить в діапазон від 10 до 20')
} else {
    alert('Число не входить в діапазон від 10 до 20')
}

//5
// Створити розмітку  з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні — виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.


const name = prompt('введіть своє імя', '');
const email = prompt('введіть свій email', '');
const password = prompt('введіть пароль', '');
if(name.length > 3 && email.includes('@') && email.includes('.') && password.length > 6) {
   alert('всі дані заповнені коректно')
} else {
    alert('помилка')
}
