//1
// Створити розмітку з формою, що містить список (select) з трьома варіантами вибору: "Кава", "Чай" та "Сік". При виборі кожного варіанту виводити відповідне повідомлення в блок на сторінці.

let drinks = +prompt("виберіть напій: 1-кава, 2-чай, 3-сік", "");
switch (drinks) {
  case 1:
    alert("ви вибрали каву");
    break;
  case 2:
    alert("ви вибрали чай");
    break;
  case 3:
    alert("ви вибрали сік");
    break;
  default:
    alert("ви нічого не вибрали");
    break;
}

//2
// Створити розмітку з полем введення, що приймає рядок та кнопкою. При натисканні на кнопку перевіряти, чи введений рядок є днем тижня (наприклад: "понеділок", "вівторок" і т.д.), виводити відповідне повідомлення про робочий день або вихідний.

let day = prompt("введіть день тижня");
switch (day) {
  case "Понеділок":
  case "Вівторок":
  case "Середа":
  case "Четвер":
  case "П'ятниця":
    alert("Робочий день");
    break;
  case "Субота":
  case "Неділя":
    alert("Вихідний");
    break;
  default:
    alert("введений рядок не є днем тижня");
    break;
}

//3
// Створити розмітку з полем введення, що приймає номер місяця та кнопкою. При натисканні на кнопку виводити повідомлення про пору року, до якої належить цей місяць.

let season = +prompt("введіть номер місяця");
switch (season) {
  case 1:
  case 2:
  case 12:
    alert("Зима");
    break;
  case 3:
  case 4:
  case 5:
    alert("Весна");
    break;
  case 6:
  case 7:
  case 8:
    alert("Літо");
    break;
  case 9:
  case 10:
  case 11:
    alert("Осінь");
    break;
  default:
    alert("невідомий місяць");
    break;
}

//4
// Створити розмітку з полем введення, що приймає номер місяця та кнопкою. При натисканні на кнопку виводити кількість днів у цьому місяці.

let daysInMonth = +prompt("введіть номер місяця", "");
switch (daysInMonth) {
  case 1:
  case 3:
  case 5:
  case 7:
  case 8:
  case 10:
  case 12:
    alert("цей місяць має 31 день");
    break;
  case 4:
  case 6:
  case 9:
  case 11:
    alert("цей місяць має 30 днів");
    break;
  case 2:
    alert("цей місяць має 29 днів");
    break;
  default:
    alert("невідомий місяць");
    break;
}

//5
// Створити розмітку з полем введення, що приймає назву кольору (наприклад, "червоний", "синій" і т.д.) та кнопкою. При натисканні на кнопку виводити відповідне повідомлення про дію: якщо це "червоний" — "стоп", якщо "зелений" — "йти", якщо "жовтий" — "чекати".

let colors = prompt("виберіть колір: 1-червоний, 2-зелений, 3-жовтий ", "");
switch (colors) {
  case "1":
    alert("стоп");
    break;
  case "2":
    alert("йти");
    break;
  case "3":
    alert("чекати");
    break;
  default:
    alert("невідомий колір");
    break;
}

//6
// Створити розмітку з двома полями введення, що приймають числа та список (select) з варіантами вибору операцій: "+", "-", "*", "/". При натисканні на кнопку виводити результат обраної операції над цими числами. Користувач повинен бути попереджений про можливість ділення на нуль.

let num1 = +prompt("введіть число", "");
let num2 = +prompt("введіть число", "");
let operation = prompt("введіть операцію '+', '-', '*', '/'");
let result = 0;

switch (operation) {
  case "+":
    result = num1 + num2;
    break;
  case "-":
    result = num1 - num2;
    break;
  case "*":
    result = num1 * num2;
    break;
  case "/":
    if (num2 !== 0) {
      result = num1 / num2;
    } else {
      alert("не можна ділити на нуль");
    }
    break;
  default:
    alert("невірна операція");
    break;
}
alert(result);
